{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_22", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_pitch"}, "name": "input_pitch", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_duration"}, "name": "input_duration", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_53", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 35, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_53", "inbound_nodes": [[["input_pitch", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_54", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_54", "inbound_nodes": [[["input_duration", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_25", "inbound_nodes": [[["embedding_53", 0, 0, {}], ["embedding_54", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_25", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_25", "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "pitch", "trainable": true, "dtype": "float32", "units": 35, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pitch", "inbound_nodes": [[["lstm_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "duration", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "duration", "inbound_nodes": [[["lstm_25", 0, 0, {}]]]}], "input_layers": [["input_pitch", 0, 0], ["input_duration", 0, 0]], "output_layers": [["pitch", 0, 0], ["duration", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "duration/kernel", "shape": [512, 30], "dtype": "float32"}, {"name": "duration/bias", "shape": [30], "dtype": "float32"}, {"name": "embedding_53/embeddings", "shape": [35, 256], "dtype": "float32"}, {"name": "embedding_54/embeddings", "shape": [30, 256], "dtype": "float32"}, {"name": "lstm_25/lstm_cell_25/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_25/lstm_cell_25/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_25/lstm_cell_25/bias", "shape": [2048], "dtype": "float32"}, {"name": "pitch/kernel", "shape": [512, 35], "dtype": "float32"}, {"name": "pitch/bias", "shape": [35], "dtype": "float32"}]}]}