{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_25", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_pitch"}, "name": "input_pitch", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_duration"}, "name": "input_duration", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_59", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 35, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_59", "inbound_nodes": [[["input_pitch", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_60", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_60", "inbound_nodes": [[["input_duration", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_28", "inbound_nodes": [[["embedding_59", 0, 0, {}], ["embedding_60", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_28", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_28", "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "pitch", "trainable": true, "dtype": "float32", "units": 35, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pitch", "inbound_nodes": [[["lstm_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "duration", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "duration", "inbound_nodes": [[["lstm_28", 0, 0, {}]]]}], "input_layers": [["input_pitch", 0, 0], ["input_duration", 0, 0]], "output_layers": [["pitch", 0, 0], ["duration", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "duration/kernel", "shape": [1024, 30], "dtype": "float32"}, {"name": "duration/bias", "shape": [30], "dtype": "float32"}, {"name": "embedding_59/embeddings", "shape": [35, 512], "dtype": "float32"}, {"name": "embedding_60/embeddings", "shape": [30, 512], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_28/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_28/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_28/lstm_cell_28/bias", "shape": [4096], "dtype": "float32"}, {"name": "pitch/kernel", "shape": [1024, 35], "dtype": "float32"}, {"name": "pitch/bias", "shape": [35], "dtype": "float32"}]}]}